'use strict';


/*
 ***************************************
 * 加载依赖模块
 ***************************************
 */
const
    fs = require('fs'),
    path = require('path');


/*
 ***************************************
 * 定义生成目录函数
 ***************************************
 */
function mkdir(dir) {
    return new Promise((resolve, reject) => {
        fs.stat(dir, err => {

        })

    });
}

/*
 ***************************************
 * 抛出接口
 ***************************************
 */
module.exports = mkdir;
